SYE/Resources/GenericAttachmentTemplate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:mas="http://provider.model.service.ols.cqc.org.uk/masterdata"
                  xmlns:att="http://provider.model.service.ols.cqc.org.uk/generic/attachment">
  <soapenv:Header>
    <mas:Credentials>
      <mas:tokenId>{{token}}</mas:tokenId>
      <mas:originatingSystem>SYE</mas:originatingSystem>
      <mas:originatingSystemId>GFC</mas:originatingSystemId>
      <mas:status>SUCCESS</mas:status>
    </mas:Credentials>
  </soapenv:Header>
  <soapenv:Body>
    <att:CreateEnquiry_Input>
      <att:CQCEnquiry>
        <att:Enquiry>
          <att:OrganisationId>1-1089472276</att:OrganisationId>
          <att:ListOfDataItems>
            <att:Data>
              <!--Optional:-->
              <!--Optional:-->
              <att:ListOfAttachments>
                <!--Zero or more repetitions:-->
                <att:Attachment>
                  <att:PrimaryContent>
                    <att:FileName>Registration.pdf</att:FileName>
                    <att:FileContent>{{payload}}</att:FileContent>
                    <!--Optional:-->
                    <att:ContentType>Factual Accuracy Comments</att:ContentType>
                  </att:PrimaryContent>
                  <!--Optional:-->
                  <att:ListOfAlternateFileRepresentations>
                    <!--Zero or more repetitions:-->
                    <att:AlternateFileRepresentations>
                      <att:FileName/>
                      <att:FileContent/>
                      <!--Optional:-->
                    </att:AlternateFileRepresentations>
                  </att:ListOfAlternateFileRepresentations>
                </att:Attachment>
              </att:ListOfAttachments>
            </att:Data>
          </att:ListOfDataItems>
          <att:Category>Monitor and Inspect</att:Category>
          <att:Type>Share your experience</att:Type>
          <att:Subtype>{{subtype}}</att:Subtype>
          <att:SourceChannel>Web</att:SourceChannel>
          <att:CommMethod></att:CommMethod>
          <att:ContactPhone></att:ContactPhone>
          <att:ContactLastName></att:ContactLastName>
          <att:ContactFirstName></att:ContactFirstName>
          <att:ContactEmail>gfcPortal1@cqc.org</att:ContactEmail>
          <att:sourceApplication>Drupal</att:sourceApplication>
          <att:sourceSystem>Drupal</att:sourceSystem>
          <att:initialReceiptDate>2019-04-18</att:initialReceiptDate>
          <att:Creator>gfcPortal1</att:Creator>
          <att:olsSubmissionNumber>{{submissionNumber}}</att:olsSubmissionNumber>
        </att:Enquiry>
      </att:CQCEnquiry>
    </att:CreateEnquiry_Input>
  </soapenv:Body>
</soapenv:Envelope>
